---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGuidKey.Equals(System.Object)
source: html/98e0f031-e103-89a6-2ae7-de8c1bded6cd.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey.Equals Method

Determines whether this IFCGuidKey is equal to another.

## Syntax (C#)
```csharp
public override bool Equals(
	Object other
)
```

## Parameters
- **other** (`System.Object`) - The IFCGuidKey with which to compare this IFCGuidKey.

## Returns
True if the given IFCGuidKey is equal to this one, or false otherwise.